# Description Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..Description Property
Alignment Class See Also
---
The Description of this alignment.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public string Description { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Description As String
	Get
```

Visual C++
---
```text
public:
property String^ Description {
	String^ get ();
}
```

# See Also
Alignment Class
Autodesk.Revit.DB.Infrastructure Namespace